#include "Error_Data.h"

const char * VER_DATE = "V01.000.002 20210527" ;

const char * UPS_ERROR[] = 
{
	"\"供电方式\":",
	"\"电池电压过低\":",
	"\"UPS故障检测\":",
};
const char * UPS_ERROR_D1[] = 
{
	"00均不供电\",",
	"01UPS供电\",",
	"02旁路供电\",",
};

const char * VRV_ERROR[] = 
{
	"\"室内环温传感器\":",
	"\"室内管温传感器\":",
	"\"室内制热过载保护\":",
	"\"室内制冷过载保护\":",
	"\"内机、外机通讯\":",
	"\"面板与内机通讯\":",
	"\"模块故障查询(PFC保护-直流)\":",
	"\"无负载\":",
	"\"压机过热\":",
	"\"CT电流\":",
	"\"室外环温传感器\":",
	"\"室内热交换管传感器\":",
	"\"电源超压、欠压保护\":",
	"\"高压保护\":",
	"\"室外蒸发传感器\":",
	"\"制冷过载\":",
	"\"EEPROM\":",
	"\"室外回气传感器\":",
	"\"压机传感器\":",
	"\"室内蒸发传感器\":",
	"\"排水系统\":",
	"\"电源三相\":",
	"\"湿度传感器\":",
	"\"室内风机\":",
	"\"室外风机\":",
	"\"低压保护\":",
	"\"电子膨胀阀\":",
	"\"除尘网需清理\":",
	"\"冷媒不足检测\":",
	"\"检测器与空调通信\":",
	"\"与检测器的总线通信\":",
};

const char * GLD_ERROR[] = 
{
	"\"漏水绳状态\":",
};
const char * GLD_ERROR_D1[] = 
{
	"未泄露\",",
	"泄漏\",",
	"断线或线缆故障\","
};

const char * ERROR_D1[] = 
{
	"正常\",",
	"警告\",",
	"故障\","
};
const char * ERROR_D0[] = 
{
	"\"0-",
	"\"1-",
	"\"2-"
};





